package 位运算.颠倒二进制位190;

public class Solution2 {
    public int reverseBits(int n) {
        //相当于奇数位和偶数位交换
        int m1 = 0x55555555;//0101010101010101
        int m2 = 0x33333333;//0011001100110011
        int m3 = 0x0f0f0f0f;//0000111100001111
        int m4 = 0x00ff00ff;//0000000011111111

        n = ((n>>>1) & m1) | (n & m1)<<1;//偶数位先右移取到；奇数位取到后右移
        n = ((n>>>2) & m2) | (n & m2)<<2;
        n = ((n>>>4) & m3) | (n & m3)<<4;
        n = ((n>>>8) & m4) | (n & m4)<<8;

        return n>>>16 | n<<16;
    }
}
